## 01 Class exercise slicing dataframe
Use this data:
```python
data = np.array([['','Col1','Col2','col3'],
                ['Row1',1,2,3],
                ['Row2',4,5,6],
                ['Row3',7,8,9]])
```
1. Create a DataFrame (wrap the data above in a pandas DataFrame in a way that printing the dataframe and its index and column attributes gives this result)  
`pd.DataFrame(data=data[1:4,1:4], columns=data[0,1:4], index=data[1:4,0])`  

``` 
     Col1 Col2 col3  
Row1    1    2    3
Row2    4    5    6
Row3    7    8    9

Index(['Row1', 'Row2', 'Row3'], dtype='object')
Index(['Col1', 'Col2', 'col3'], dtype='object')
```

2. Make slices of data:
   1. second column using column name
   2. third column using column index (.iloc[])
   3. slice element at third row of second column (use .iloc())

In [4]:
import pandas as pd
import numpy as np

data = np.array([['','Col1','Col2','col3'],
                ['Row1',1,2,3],
                ['Row2',4,5,6],
                ['Row3',7,8,9]])

data_frame = pd.DataFrame(data=data[1:4,1:4], columns=data[0,1:4], index=data[1:4,0])

#2.1
print('2.1',data_frame['Col2'])
#2.2
print('2.2',data_frame.iloc[:,2])
#2.3
print('2.3',data_frame.iloc[2,1])

2.1 Row1    2
Row2    5
Row3    8
Name: Col2, dtype: object
2.2 Row1    3
Row2    6
Row3    9
Name: col3, dtype: object
2.3 8

## 02 Exercise Pandas Data Series
The CO2 Emission data set above is not updated since 2014
1. Create a Pandas Series with emission data from 2014 for each country or region

In [7]:
data = pd.read_csv('./API_EN.ATM.CO2E.KT_DS2_en_csv_v2_3642506.csv', skiprows=4)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Unnamed: 65
0,Aruba,ABW,CO2 emissions (kt),EN.ATM.CO2E.KT,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,CO2 emissions (kt),EN.ATM.CO2E.KT,118545.901306,123758.90333,128093.897815,132810.33253,144345.352398,155803.780096,...,559333.857277,580510.924989,601860.163983,586385.004029,592299.593959,601323.394691,600351.133333,NaN,NaN,NaN
2,Afghanistan,AFG,CO2 emissions (kt),EN.ATM.CO2E.KT,414.371000,491.37800,689.396000,707.73100,839.743000,1008.425000,...,10450.000000,8510.000000,7810.000000,7990.000000,7390.000000,7380.000000,7440.000000,NaN,NaN,NaN
3,Africa Western and Central,AFW,CO2 emissions (kt),EN.ATM.CO2E.KT,8760.463000,9376.51900,9710.216000,11540.04900,13985.938000,19827.469000,...,181740.000000,191990.000000,198440.000000,193060.000000,195120.000000,201900.000000,224380.000000,NaN,NaN,NaN
4,Angola,AGO,CO2 emissions (kt),EN.ATM.CO2E.KT,550.050000,454.70800,1180.774000,1151.43800,1224.778000,1188.108000,...,30250.000000,32820.000000,34630.000000,35160.000000,35410.000000,30840.000000,27340.000000,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Kosovo,XKX,CO2 emissions (kt),EN.ATM.CO2E.KT,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
262,"Yemen, Rep.",YEM,CO2 emissions (kt),EN.ATM.CO2E.KT,58.672000,73.34000,69.673000,80.67400,99.009000,102.676000,...,19680.000000,26350.000000,26710.000000,14210.000000,10880.000000,10060.000000,9310.000000,NaN,NaN,NaN
263,South Africa,ZAF,CO2 emissions (kt),EN.ATM.CO2E.KT,97934.569000,102213.95800,105767.281000,109826.65000,119657.877000,128260.659000,...,426710.000000,436870.000000,447980.000000,424880.000000,425180.000000,435140.000000,433250.000000,NaN,NaN,NaN
264,Zambia,ZMB,CO2 emissions (kt),EN.ATM.CO2E.KT,NaN,NaN,NaN,NaN,3278.298000,3916.356000,...,4020.000000,4240.000000,4800.000000,5070.000000,5590.000000,6990.000000,7740.000000,NaN,NaN,NaN
265,Zimbabwe,ZWE,CO2 emissions (kt),EN.ATM.CO2E.KT,NaN,NaN,NaN,NaN,4473.740000,5214.474000,...,12110.000000,12360.000000,12150.000000,12400.000000,10990.000000,10230.000000,12270.000000,NaN,NaN,NaN

2. Find the 10 Countries/Regions with the highest emissions in 2014 and show emission numbers (reverse sorted)

In [26]:
data.sort_values('2014',ascending=False)[['Country Name', '2014']][:10]

                  Country Name          2014
259                      World  3.308519e+07
103           IDA & IBRD total  2.070376e+07
140        Low & middle income  2.017551e+07
156              Middle income  2.000640e+07
102                  IBRD only  1.994180e+07
249        Upper middle income  1.509276e+07
142  Late-demographic dividend  1.436089e+07
63         East Asia & Pacific  1.415519e+07
95                 High income  1.253364e+07
181               OECD members  1.209443e+07

3. Remove if you can those rows that are not countries (regions and aggregated groups) (hint:  [ISO 3166, Alpha-3 country codes](https://www.iban.com/country-codes), a csv file can be found here: `/data/country_codes.csv`)
    - Find the 10 countries with highest emissions in 2014

In [74]:
codes = pd.read_csv('../../data/country_codes.csv', sep='\t', header=None)[2]
codes = codes.str.strip()
data[data['Country Code'].isin(codes)].sort_values('2014', ascending=False)[['Country Name','2014']][:10]

           Country Name       2014
40                China  9894940.0
251       United States  5102580.0
109               India  2136870.0
202  Russian Federation  1606860.0
119               Japan  1219820.0
55              Germany   737490.0
112  Iran, Islamic Rep.   610670.0
126         Korea, Rep.   586000.0
35               Canada   561830.0
205        Saudi Arabia   536810.0

4. Plot the emissions of China and USA over time respectively

## Ex1 Use data from Danmarks Statistik - Databanken
1. Go to https://www.dst.dk/da/Statistik/brug-statistikken/muligheder-i-statistikbanken/api#testkonsol
2. Open 'Konsol' and click 'Start Konsol'
3. In the console at pt 1: choose 'Retrieve tables', pt 2: choose get request and json format and pt 3: execute:
    1. check the result
    2. in the code below this same get request is used to get information about all available data tables in 'databanken'. 
4. Change pt. 1 in the console to 'Retrieve data', pt 2: 'get request' and Table id: 'FOLK1A', format: csv, delimiter: semicolon and click: 'Variable and value codes' and choose some sub categories (Hint: hover over the codes to see their meaning). Finally execute and see what data you get.
5. With data aggregation and data visualization answer the following questions:
    1. What is the change in pct of divorced danes from 2008 to 2020?
    2. Which of the 5 biggest cities has the highest percentage of 'Never Married' in 2020?
    3. Show a bar chart of changes in marrital status in Copenhagen from 2008 till now
    4. Show 2 plots in same figure: 'Married' and 'Never Married' for all ages in DK in 2020 (Hint: x axis is age from  0-125, y axis is how many people in the 2 categories). Add lengend to show names on graphs

## Ex2 Use another table (extra)
Choose any of the other tables in 'databanken' to find interesting data.
1. Collect the data
2. Pose 5 or more interesing questions to the data
3. Answer the questions by aggregating the data
4. Illustrate the answers with visual plots